A massing cannot be copied. Copy the elements within the massing instead.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyMassing { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyMassing As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyMassing {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace